app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "commentable_type", "commentable_id", "updated_at", "content") VALUES('2009-04-05 20:37:42', 'Group', 2, '2009-04-05 20:37:42', 'This is a test.')
SELECT * FROM "groups" WHERE ("groups"."id" = 2)
---
  def create
    @commentable = find_commentable
    @comment = @commentable.comments.build(params[:comment])

    if @comment.save
      flash[:notice] = "Comment created. "
      case @comment.commentable_type
        when "Group"
          redirect_to group_path(Group.find(@comment.commentable_id)) # FIXME?