app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT * FROM "groups"

  def show
    @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

  def edit
    @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "dues", "dues_collected", "created_at", "grants_written", "yield_average", "wait", "updated_at", "votes_held", "principals", "members", "purpose", "withdrawals") VALUES('foo', 1, NULL, '2009-04-05 17:22:02', NULL, NULL, 7, '2009-04-05 17:22:02', NULL, NULL, NULL, 'bar', NULL)

  def update
    @group = Group.find(params[:id])

    respond_to do |format|
      if @group.update_attributes(params[:group])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)
UPDATE "groups" SET "updated_at" = '2009-04-05 17:26:23', "purpose" = 'foo' WHERE "id" = 1

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)
DELETE FROM "groups" WHERE "id" = 1