app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.build_profile(:user => @user)
    @user.build_credit(:user => @user, :pebbles => 1)
    if @user.save
---
INSERT INTO "users" ("last_request_at", "created_at", "crypted_password", "updated_at", "perishable_token", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('2009-04-05 19:03:42', '2009-04-05 19:03:42', '68b294cea9727771e11069a9b6d39eb75c29dce36f11bb526b80e6d9b86ceedea15afe166b784814a5e60178b7ed7aeb10d8f678405a486a4e7568a0dbd95355', '2009-04-05 19:03:42', 'pqPoXdoUta-ek8-DWc_b', '127.0.0.1', '8j5cTqwNCS9Ut1PO27Yw', '2009-04-05 19:03:42', 'f8a5ad97783f0ec27e1bc36d04004df2f13d02efdf448b12a01cf5075aed7ac2bcc513a6a78731a9f5cb33eae68459d1b31c0d27ab0c1b8332cd7d456fc5c9fc', 1, NULL, 'tefflox', NULL, 'tefflox@gmail.com')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent

    new_password = params[:user][:new_password]
    confirmation = params[:user][:confirm_new_password]
    if !new_password.blank? and new_password == confirmation
      if @user.valid_password?(params[:user][:current_password])
        @user.password = new_password
        @user.password_confirmation = new_password
      end
    end

    email = params[:user][:email]
    login = params[:user][:login]

    new_email = email != @user.email
    new_login = login != @user.login

    if new_email or new_login
      if @user.valid_password?(params[:user][:password_confirm_vital])
        if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2009-04-05 19:42:12', "perishable_token" = 'LlXkeeyJgRuUZaAo_3bw', "last_request_at" = '2009-04-05 19:42:12' WHERE "id" = 1